# Итоговая контрольная работа по основному блоку.

 1. Создать репозиторий на GitHub
 2. Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)
 3. Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)
 4. Написать программу, решающую поставленную задачу
 5. Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах)


 Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Примеры:
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]
[“Russia”, “Denmark”, “Kazan”] → []

**P/S Реализация задачи будет на языке C#.**

## Последовательный план выполнения задачи:


1. Создаем строковый массив в клиентском коде:
```
string[] array = new string[7] {"Hello", "2", "world", "1563", "321", "-2", "Russia"};
```


2. Создаем метод для поиска в массиве всех элементов с размером 3 или меньше символов:
```
int CountWordsWithThreeOrLessCharsInArray (string [] arr, int count = 0)
{
for (int i = 0; i < arr.Length; i++)
{
    if (arr[i].Length <= 3) count++;
}
    return count;
}
```
В данный метод мы будем передавать строковый массив `string[] arr`, а также создадим переменную `int count` для подсчета количества элементов с размером 3 или меньше символов. Данная переменная поможет нам определить длинну нового массива в который мы поместим элементы в соответствии с условием задачи.

Для прохождения по каждому элементу массива мы будем использовать цикл `for`.
Для подсчета количества символов воспользуемся свойством `.Length`


3. Следующим этапом реализации задачи будет создание нового строкого массива и его заполнение:
```
string[] CreateAndFillArrayWithThreeOrLessCharElem (int size, string[] arr)
{
    string[] ar = new string [size];
    int j = 0;
for (int i = 0; i < arr.Length; i++)
{
    if (arr[i].Length <= 3)
    {
        ar[j] = arr[i];
        j++;
    }
}
    return ar;
}
```
В данный метод мы передаем:
* `int size`. Данный параметр нам необходим для определения длинны нового массива. Мы его найдем благодаря предыдущему методу `int CountWordsWithThreeOrLessCharsInArray()`.
* строковый массив `string[] array`.

Создаем новый массив:  
```
string[] ar = new string [size];
```
Так как у нас массивы `string[] array` и `string[] ar` имеют разную длинну, то мы  создаем переменную счетчик для нового массива:
```
int j = 0;
```

Далее мы используем цикл `for` для прохождения по всем элементам массива `strin[] array`. 
```
for (int i = 0; i < arr.Length; i++)
{
... код
}
```
Создаем условие в цикле для нахождения элемента с количеством символов 3 иил меньше:
```
if (arr[i].Length <= 3)
```
Если такой элемент найден, то мы его записываем в новый массив `string[] ar` и увеличиваем счетчик `j`:
```
 ar[j] = arr[i];
 j++;
```

После окончания цикла `for` возвращаем новый массив:
```
return ar;
```


4. Для отображения элементов в массивах создаем метод:
```
void PrintArray(string[] arr, char sep = '"')
{
    Console.Write("[");
    for (int i = 0; i < arr.Length-1; i++)
    {
        Console.Write($"{sep}{arr[i]}{sep}," + "  ");
    }
    Console.Write($"{sep}{arr[arr.Length-1]}{sep}]");
}
```
В метод передаем параметры:
* `string[] arr`какой массив мы хотим отображать будет прописано в клиентском коде.
* `char sep` для оформления, как в условии задачи
```
["Hello", "2", "world", ":-)"] → ["2", ":-)"]
```


5. Прописывываем вызовы методов и их параметры, а также доофрмляем вывод результата в соответствие с условием задачи:
```
Console.WriteLine("Массив строк: ");
PrintArray(array);
 Console.WriteLine("\n");
string [] newArray = CreateAndFillArrayWithThreeOrLessCharElem(CountWordsWithThreeOrLessCharsInArray(array), array);
Console.WriteLine("Новый массив из строк, длина которых меньше, либо равна 3 символам: ");
PrintArray(newArray);
 Console.WriteLine("\n");
PrintArray(array);
Console.Write(" → ");
PrintArray(newArray);
Console.WriteLine("\n");;
```